&НаСервере
Процедура СоздатьАктыНаСервере()
	
	ДлительныеОперации.ВыполнитьПроцедуру(, "Обработка.ВКМ_МассовоеСозданиеАктов.ЗаполнитьТабЧасть", , , , , , , )
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАкты(Команда)
	СоздатьАктыНаСервере();
КонецПроцедуры

&НаСервере 
Функция ЗаполнитьТабЧасть() Экспорт
	
	ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачала >= &ДатаНачала
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончания <= &ДатаОкончания
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)";
	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Объект.Период.ДатаОкончания));
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из Выборка Цикл
		
		РеализацияТоваровУслуг = НеобходимостьСозданияДокумента(Строка.Договор);
		
		Если РеализацияТоваровУслуг Тогда
			
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
			ДокументРеализация.Заполнить(Строка);
			ДокументРеализация.Договор = Выборка.СсылкаДоговор;
			ДокументРеализация.Организация = Выборка.Организация;
			ДокументРеализация.Контрагент = Выборка.Контрагент;
			
			ДокументРеализация.ВКМ_ЗаполнитьУслуги(Строка.Договор);
			
			ДокументРеализация.ПроверитьЗаполнение();
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
			
			НоваяСтрока = Объект.Договоры.Добавить();
			НоваяСтрока.Договор = Строка.Договор;
			НоваяСтрока.Реализация = ДокументРеализация.Ссылка;
			НоваяСтрока.СуммаДокумента = ДокументРеализация.СуммаДокумента;
			
		Иначе
			
			ДокументРеализация = Выборка.СсылкаРеализация.ПолучитьОбъект();
			
		КонецЕсли;
		
		ДокументРеализация.ВыполнитьАвтозаполнение();
		ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецФункции

Функция НеобходимостьСозданияДокумента(Договор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Номер
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОконачния
	|	И РеализацияТоваровУслуг.Проведен";	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Объект.Период.ДатаОкончания));
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции



